tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Fish shell
brew "fish"

# Latest versions of pre-installed commands
brew "git"
brew "grep"
brew "less"

# Python
brew "python"
brew "python@3.8"
brew "pyenv"
brew "pipenv"

# Python build dependencies
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Useful command line tools
brew "gettext"
brew "diff-so-fancy"
brew "ffmpeg"
brew "httpie"
brew "jq"
brew "thefuck"
brew "watch"
brew "yarn"
brew "youtube-dl"

# Xcode
brew "mas"
mas "xcode", id: 497799835

# Apps for development
cask "atom"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "visual-studio-code"
