tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Fish shell
brew "fish"

# JS development
brew "node"
brew "pnpm"
brew "yarn"

# Python development
brew "python"
brew "python@3.8"
brew "pyenv"
brew "pipenv"

# Python build deps
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Useful CLI tools
brew "bat"
brew "bat-extras"
brew "diff-so-fancy"
brew "fd"
brew "ffmpeg"
brew "httpie"
brew "jq"
brew "p7zip"
brew "svgo"
brew "watch"
brew "yarn"
brew "yt-dlp"
brew "yq"

# Updated built-in tools
brew "git"
brew "less"

# Latest GNU software
brew "bash"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "grep"
brew "gzip"
brew "make"
brew "screen"
brew "wget"

# GUI apps
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "chromium"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "logitune"
cask "lunar"
cask "messenger"
cask "notion"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Mac App Store
brew "mas"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
